twitter_clone/app/controllers/tweets_controller.rb

  def index
    @tweet = Tweet.all
---
SELECT "tweets".* FROM "tweets"

  def create
    @tweet = Tweet.new(tweet_params)
    if params[:back]
      render :new
    else
      if @tweet.save
---
INSERT INTO "tweets" ("content") VALUES ($1) RETURNING "id"  [["content", "Good Morning!"]]

  def update
    if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "content" = $1 WHERE "tweets"."id" = $2  [["content", "おはようございます."], ["id", 20]]

  def destroy
    @tweet.destroy
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 22]]

  def set_tweet
    @tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]