twitter_clone/app/controllers/tweets_controller.rb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @tweet = Tweet.find(params[:id])